In [1]:
import pandas as pd

In [4]:
data = pd.read_csv('./csv_files/ahmedabad.csv', usecols=[1,2,3])
data

,company_name,company_rating,other_data
0,Zydus Lifesciences,4.2,"Pharma , 10k-50k Employees , Public , 72 years..."
1,Intas Pharmaceuticals,4.2,"Pharma , 10k-50k Employees , Fortune India 500..."
2,Vodafone Idea,4.2,"Telecom , 5k-10k Employees , Public , 6 years ..."
3,TTEC India,3.8,"BPO , 1k-5k Employees , Public , 40 years old ..."
4,Cadila Pharmaceuticals,3.6,"Pharma , 5k-10k Employees , Public , 73 years ..."
...,...,...,...
9995,Aadharshila School,4.9,"Education & Training , 11-50 Employees , Ahmed..."
9996,Adroit Valuations,3.5,"Accounting & Auditing , 201-500 Employees , Ah..."
9997,Meru Consultants,1.0,"30 years old , Ahmedabad"
9998,Excare Laboratories,4.0,Ahmedabad
9999,Mgli,4.5,Ahmedabad

In [5]:
data['other_data']

0       Pharma , 10k-50k Employees , Public , 72 years...
1       Pharma , 10k-50k Employees , Fortune India 500...
2       Telecom , 5k-10k Employees , Public , 6 years ...
3       BPO , 1k-5k Employees , Public , 40 years old ...
4       Pharma , 5k-10k Employees , Public , 73 years ...
                              ...
9995    Education & Training , 11-50 Employees , Ahmed...
9996    Accounting & Auditing , 201-500 Employees , Ah...
9997                             30 years old , Ahmedabad
9998                                            Ahmedabad
9999                                            Ahmedabad
Name: other_data, Length: 10000, dtype: object

In [6]:
data['other_data'][0]

'Pharma , 10k-50k Employees , Public , 72 years old , Ahmedabad +152 more'

In [7]:
data['other_data'].apply(lambda x: x.split(' , '))

0       [Pharma, 10k-50k Employees, Public, 72 years o...
1       [Pharma, 10k-50k Employees, Fortune India 500,...
2       [Telecom, 5k-10k Employees, Public, 6 years ol...
3       [BPO, 1k-5k Employees, Public, 40 years old, A...
4       [Pharma, 5k-10k Employees, Public, 73 years ol...
                              ...
9995    [Education & Training, 11-50 Employees, Ahmeda...
9996    [Accounting & Auditing, 201-500 Employees, Ahm...
9997                            [30 years old, Ahmedabad]
9998                                          [Ahmedabad]
9999                                          [Ahmedabad]
Name: other_data, Length: 10000, dtype: object

In [8]:
data['other_data'].apply(lambda x: x.split(' , ')).apply(lambda x: True if len(x)==5 else False)

0        True
1        True
2        True
3        True
4        True
        ...
9995    False
9996    False
9997    False
9998    False
9999    False
Name: other_data, Length: 10000, dtype: bool

In [9]:
data[data['other_data'].apply(lambda x: x.split(' , ')).apply(lambda x: True if len(x)==5 else False)]

,company_name,company_rating,other_data
0,Zydus Lifesciences,4.2,"Pharma , 10k-50k Employees , Public , 72 years..."
1,Intas Pharmaceuticals,4.2,"Pharma , 10k-50k Employees , Fortune India 500..."
2,Vodafone Idea,4.2,"Telecom , 5k-10k Employees , Public , 6 years ..."
3,TTEC India,3.8,"BPO , 1k-5k Employees , Public , 40 years old ..."
4,Cadila Pharmaceuticals,3.6,"Pharma , 5k-10k Employees , Public , 73 years ..."
...,...,...,...
9673,One Way Cab,4.7,"Internet , 11-50 Employees (Global) , Startup ..."
9712,Centre For Electronic Governance,4.4,"Government , 51-200 Employees (Global) , Publi..."
9832,Kalupur Bank,NaN,"Banking , 501-1k Employees (Global) , Public ,..."
9964,Fulford India,4.3,"Pharma , 501-1k Employees , Public , 76 years ..."
9972,Department of Telecommunications,4.3,"Telecom , 1k-5k Employees (Global) , Public , ..."

In [10]:
import os

In [11]:
source_path = os.path.join(os.getcwd(), 'csv_files')
source_path

'C:\\Users\\hello\\Grras_Data\\Grras Solutions Pvt. Ltd\\Data Science feb\\DS project\\ambition box analysis\\csv_files'

In [12]:
destination_path = os.path.join(os.getcwd(), 'filter_csv')
destination_path

'C:\\Users\\hello\\Grras_Data\\Grras Solutions Pvt. Ltd\\Data Science feb\\DS project\\ambition box analysis\\filter_csv'

In [14]:
current_path = os.getcwd()
current_path

'C:\\Users\\hello\\Grras_Data\\Grras Solutions Pvt. Ltd\\Data Science feb\\DS project\\ambition box analysis'

In [16]:
def clean_csv(source, destination,current_path):
    os.chdir(source)
    ls = os.listdir()
    print(ls)
    os.chdir(current_path)

In [17]:
clean_csv(source_path, destination_path, current_path)

['.ipynb_checkpoints', 'ahmedabad.csv', 'bangalore.csv', 'chennai.csv', 'gurugram.csv', 'hyderabad.csv', 'indore.csv', 'jaipur.csv', 'mumbai.csv', 'noida.csv', 'pune.csv']

In [18]:
def clean_csv(source, destination,current_path):
    os.chdir(source)
    ls = os.listdir()
    for i in ls:
        if i.endswith('.csv'):
            data = pd.read_csv(i, usecols=[1,2,3])
            data = data[data['other_data'].apply(lambda x: x.split(' , ')).apply(lambda x: True if len(x)==5 else False)]
            data.to_csv(os.path.join(destination, i))
    os.chdir(current_path)

In [19]:
clean_csv(source_path, destination_path, current_path)

In [22]:
ahmedabad = pd.read_csv('./filter_csv/ahmedabad.csv', usecols=[1,2,3])
ahmedabad

,company_name,company_rating,other_data
0,Zydus Lifesciences,4.2,"Pharma , 10k-50k Employees , Public , 72 years..."
1,Intas Pharmaceuticals,4.2,"Pharma , 10k-50k Employees , Fortune India 500..."
2,Vodafone Idea,4.2,"Telecom , 5k-10k Employees , Public , 6 years ..."
3,TTEC India,3.8,"BPO , 1k-5k Employees , Public , 40 years old ..."
4,Cadila Pharmaceuticals,3.6,"Pharma , 5k-10k Employees , Public , 73 years ..."
...,...,...,...
1230,One Way Cab,4.7,"Internet , 11-50 Employees (Global) , Startup ..."
1231,Centre For Electronic Governance,4.4,"Government , 51-200 Employees (Global) , Publi..."
1232,Kalupur Bank,NaN,"Banking , 501-1k Employees (Global) , Public ,..."
1233,Fulford India,4.3,"Pharma , 501-1k Employees , Public , 76 years ..."
1234,Department of Telecommunications,4.3,"Telecom , 1k-5k Employees (Global) , Public , ..."

In [30]:
ahmedabad.assign(
    industry = ahmedabad['other_data'].apply(lambda x: x.split(' , ')[0]),
    size = ahmedabad['other_data'].apply(lambda x: x.split(' , ')[1]),
    type = ahmedabad['other_data'].apply(lambda x: x.split(' , ')[2]),
    years_old = ahmedabad['other_data'].apply(lambda x: x.split(' , ')[3]).apply(lambda x: x.split()[0]).astype('int'),
    location = ahmedabad['other_data'].apply(lambda x: x.split(' , ')[4]).apply(lambda x: x.split()[0])
)

,company_name,company_rating,other_data,industry,size,type,years_old,location
0,Zydus Lifesciences,4.2,"Pharma , 10k-50k Employees , Public , 72 years...",Pharma,10k-50k Employees,Public,72,Ahmedabad
1,Intas Pharmaceuticals,4.2,"Pharma , 10k-50k Employees , Fortune India 500...",Pharma,10k-50k Employees,Fortune India 500,47,Ahmedabad
2,Vodafone Idea,4.2,"Telecom , 5k-10k Employees , Public , 6 years ...",Telecom,5k-10k Employees,Public,6,Ahmedabad
3,TTEC India,3.8,"BPO , 1k-5k Employees , Public , 40 years old ...",BPO,1k-5k Employees,Public,40,Ahmedabad
4,Cadila Pharmaceuticals,3.6,"Pharma , 5k-10k Employees , Public , 73 years ...",Pharma,5k-10k Employees,Public,73,Ahmedabad
...,...,...,...,...,...,...,...,...
1230,One Way Cab,4.7,"Internet , 11-50 Employees (Global) , Startup ...",Internet,11-50 Employees (Global),Startup,11,Ahmedabad
1231,Centre For Electronic Governance,4.4,"Government , 51-200 Employees (Global) , Publi...",Government,51-200 Employees (Global),Public,18,Ahmedabad
1232,Kalupur Bank,NaN,"Banking , 501-1k Employees (Global) , Public ,...",Banking,501-1k Employees (Global),Public,54,Ahmedabad
1233,Fulford India,4.3,"Pharma , 501-1k Employees , Public , 76 years ...",Pharma,501-1k Employees,Public,76,Ahmedabad
1234,Department of Telecommunications,4.3,"Telecom , 1k-5k Employees (Global) , Public , ...",Telecom,1k-5k Employees (Global),Public,39,Ahmedabad